[{"title": "Govt probing accounts of Adani Group-run Mumbai and Navi Mumbai airports", "content": "The Ministry of Corporate Affairs has opened an investigation into accounts of Adani Group-run Mumbai and Navi Mumbai airports. A significant part of the information being sought by the government pertains to the period from fiscal 2018 to 2022 prior to their acquisition, Adani Enterprises said. The company stated its units will respond to the communications with applicable legal provisions."}, {"title": "IndiGo Co-founder Gangwal to buy SpiceJet stake, say reports; stock up 20%", "content": "IndiGo Co-founder Rakesh Gangwal is at advanced stage of talks to buy a sizeable stake in SpiceJet, ET NOW reported. Following reports of the deal, shares of cash-strapped SpiceJet closed nearly 20% higher on Friday after hitting 52-week high of ₹43.82/share. Gangwal holds a 13.23% stake in IndiGo-parent InterGlobe Aviation while his wife holds a 2.99% stake."}, {"title": "Who is KP Ramasamy, a farmer's son who entered Forbes rich list with ₹19,146 crore?", "content": "KP Ramasamy has made his debut on Forbes India's 100 Richest list with $2.3 billion (₹19,146 crore) wealth. He's the Founder and Chairman of textiles and sugar maker KPR Mill. A farmer's son and a college dropout, the 74-year-old founded KPR Mill in 1984. The company produces 128 million garments annually which are exported to H&M, Marks & Spencer, Walmart."}, {"title": "Zomato, McDonald's fined ₹1 lakh for delivering non-vegetarian food in vegetarian order", "content": "Food delivery platform Zomato and fast food chain McDonald's have been jointly fined ₹1 lakh by Jodhpur's District Consumer Disputes Redressal Forum for delivering non-vegetarian food in place of a vegetarian food order. The consumer has been awarded ₹5,000 as litigation cost. Both monetary penalty and cost of litigation are to be borne jointly and severally by Zomato and McDonald's.\n"}, {"title": "India scraps plan to impose restrictions on laptop imports", "content": "The Indian government has reversed its decision and will not be imposing restrictions on laptop imports, Trade Secretary Sunil Barthwal said. He said that the government only wants importers to be on close watch. India is holding consultations with the industry and a new order on laptop imports will be announced by October end, Director General of Foreign Trade said."}, {"title": "Trader wins ₹8,225 compensation from Zerodha over tech glitch", "content": "Trader Vijay Gupta won ₹8,225 compensation from Zerodha over a technical glitch. Speaking to Moneycontrol, Gupta said, \"I thought that if I cannot recover this small amount, what if I lose ₹80,000 or ₹80 lakh tomorrow.\" \"It was like someone came and snatched this money from me,\" he said, adding, \"I didn't spend any money [and] researched everything on Google.\""}, {"title": "I'm surprised by how much difference being Indian makes: Banga", "content": "World Bank President Ajay Banga said he's surprised by how much difference being Indian makes. He said he was educated in India and worked here for first 15-16 years of his life, following which he held roles overseeing operations in multiple emerging markets. \"I've learned...that both countries [and their residents]...have a respect for my knowledge on the ground,\" Banga added."}, {"title": "Debt isn't bad, it should be there for development: Ajay Banga", "content": "World Bank President Ajay Banga said debt isn't bad but turns out to be so when it's out of proportion to \"what you think you can manage\". \"It's when [debt] is handled in a form that's not quite holistic that it gets you into real trouble,\" Banga said. Debt shouldn't squeeze out development but be there for it, he added."}, {"title": "Stopped buying from ultra-luxury brands like Hermès, LV: Billionaire Nikhil Kamath", "content": "Zerodha Co-founder Nikhil Kamath said he no longer buys from ultra-luxury brands like Hermès and Louis Vuitton. \"I feel [luxury brands] play you. Their entire marketing strategy is to offend and get some kind of a reaction out of you and then buy from them,\" he explained. Kamath recently featured as youngest billionaire on Forbes list of India's 100 richest."}, {"title": "Very concerned, don't know all facts: MoS IT on Lava MD's arrest", "content": "Minister of State for IT Rajeev Chandrasekhar said he's \"very concerned\" about ED's action against Lava and Vivo and Lava MD Hari Om Rai's arrest. \"While I don't know all the facts, I hope this is rapidly looked into and right thing is done by Lava and Rai,\" Chandrasekhar said. ED arrested Rai on Tuesday in a money laundering case."}, {"title": "Who won Player of the Match awards in previous India-Pakistan ODI World Cup matches?", "content": "Sachin Tendulkar was named Player of the Match for scoring 54*(62) in India-Pakistan ODI World Cup 1992 match. In 1996, Navjot Sidhu bagged it for scoring 93(115) and in 1999, Venkatesh Prasad won it for taking five wickets. Sachin bagged the award in 2003 and 2011 too. Virat Kohli and Rohit Sharma won it in 2015 and 2019 editions, respectively."}, {"title": "What was India's margin of victory against Pakistan in their 7 ODI World Cup matches?", "content": "India have won all seven matches against Pakistan in ODI World Cups. India defeated Pakistan by 43 runs in 1992. In 1996 edition, India won by 39 runs and in 1999, India won by 47 runs. India beat Pakistan by six wickets in 2003. India's margin of victory in 2011, 2015 and 2019 was 29, 76 and 89 runs, respectively."}, {"title": "If Babar Azam starts playing, nobody can stop him: Gundappa ", "content": "Ahead of India-Pakistan match, ex-India cricketer Gundappa Viswanath called Babar Azam a \"very classy player\" and said he can make runs comfortably. \"These kinds of batsmen...can come any time...And I hope it doesn't come tomorrow...But, if he starts playing, nobody can stop him,\" he added. Gundappa further said Rohit Sharma can \"tear the bowlers apart\" once he gets going. "}, {"title": "I think Virat will win battle against Shaheen Afridi: Harbhajan ", "content": "Former India cricketer Harbhajan Singh said that he is expecting Virat Kohli to win his potential battle with Shaheen Afridi in the World Cup 2023 clash between India and Pakistan on Saturday. \"He (Shaheen) needs the conditions. If...conditions are good, he becomes an excellent bowler but if...conditions are not in his favour, he is just a decent bowler,\" added Harbhajan.  "}, {"title": "What is the weather forecast for Ahmedabad where India will face Pakistan on Saturday?", "content": "India-Pakistan ODI World Cup 2023 match will begin at 2 pm in Ahmedabad on Saturday. As per AccuWeather, the chance of rain in the city on Saturday is 1% and the cloud cover is expected to be 14% during the day. Weather will be \"mostly sunny and remain very warm\", AccuWeather stated. The maximum temperature is expected to be 36°C."}, {"title": "Shubman Gill is 99% available for match against Pakistan: Rohit Sharma", "content": "Team India captain Rohit Sharma has said that Shubman Gill is 99% available for ODI World Cup 2023 match against Pakistan that will take place in Ahmedabad on Saturday. Gill had missed the first two matches in ODI World Cup 2023 due to dengue. Gill is the leading run-getter worldwide in ODIs this year with 1,230 runs at 72.35."}, {"title": "Cook retires after scoring 34,045 runs and smashing 88 hundreds in professional cricket", "content": "Former England captain Alastair Cook has announced his retirement from all forms of cricket at the age of 38. The Essex opener, who had retired from international cricket in 2018, played his last professional match last month. Cook scored 34,045 runs in professional cricket, slamming 88 hundreds and 168 fifties."}, {"title": "Who has smashed the highest score in India-Pakistan ODI World Cup matches?", "content": "Rohit Sharma holds the record for smashing the highest score in India-Pakistan ODI World Cup matches. He slammed 140 against Pakistan in their 2019 World Cup match in Manchester. He's followed by Virat Kohli, who slammed 107 against Pakistan in their 2015 World Cup match. Saeed Anwar is third on the list with 101 against India in 2003 World Cup."}, {"title": "All streaks are meant to be broken: Babar on Pakistan's 0-7 ODI WC record against India", "content": "Talking about Pakistan's 0-7 record against India in ODI World Cup history, Pakistan captain Babar Azam said, \"All these streaks are meant to be broken.\" He added, \"God willing...We'll try to give our best tomorrow. Anything can happen on the day. I fully believe my team has done well in...first two matches, and will continue doing so in...coming matches.\""}, {"title": "X user says Khamenei got grey tick, Musk says 'applying UN rule'", "content": "An X user shared a screenshot of Iran's Supreme Leader Ayatollah Khamenei's profile showing a grey checkmark, which is given to accounts representing a government/multilateral organisation/official. \"What's this Elon Musk? That wasn't there yesterday,\" the user said. Billionaire X owner Elon Musk responded by saying, \"We're applying the UN rule...if the UN recognises someone, then we will.\""}, {"title": "India scraps plan to impose restrictions on laptop imports", "content": "The Indian government has reversed its decision and will not be imposing restrictions on laptop imports, Trade Secretary Sunil Barthwal said. He said that the government only wants importers to be on close watch. India is holding consultations with the industry and a new order on laptop imports will be announced by October end, Director General of Foreign Trade said."}, {"title": "Pics show 1st mobile tower at Siachen Glacier, world's highest battlefield", "content": "The first-ever mobile tower has been installed at Siachen Glacier, known as the world's highest battlefield. The tower was installed by the Indian Army in collaboration with Bharat Sanchar Nigam Limited (BSNL). Sharing the pictures, Union Minister of State for Communications Devusinh Chauhan said, \"Now our heroes can talk to their near and dear ones at their convenience.\""}, {"title": "Very concerned, don't know all facts: MoS IT on Lava MD's arrest", "content": "Minister of State for IT Rajeev Chandrasekhar said he's \"very concerned\" about ED's action against Lava and Vivo and Lava MD Hari Om Rai's arrest. \"While I don't know all the facts, I hope this is rapidly looked into and right thing is done by Lava and Rai,\" Chandrasekhar said. ED arrested Rai on Tuesday in a money laundering case."}, {"title": "Microsoft's $69 billion Activision deal, biggest-ever in gaming, cleared by UK", "content": "UK's Competition and Markets Authority has approved Microsoft's $69 billion acquisition of Activision Blizzard. Microsoft's offer to sell some gaming rights to French publisher Ubisoft satisfied any competition concerns it had, CMA said. The approval allows the companies to complete the biggest ever deal in gaming, following which Microsoft will become the world's third-largest gaming company. "}, {"title": "Grandfather fought in WWII for 6 yrs, dropped out of school: Musk", "content": "Billionaire Elon Musk said his grandfather fought in World War II for six years and suffered from \"severe PTSD\". He said his grandfather dropped out of high school but scored high in an IQ test taken towards the war's end. Due to this, he was sent to work for British Intelligence, else \"he'd probably be dead and I wouldn't exist\"."}, {"title": "No place for terrorist groups: X to EU on disinformation ultimatum", "content": "X CEO Linda Yaccarino replied to EU industry chief Thierry Breton's 24-hour ultimatum, urging X to remove disinformation regarding the Israel war. \"There's no place on X for terrorist organisations or violent extremist groups...we continue to remove such accounts in real-time,\" Yaccarino said. X has removed or labelled tens of thousands of content pieces since the war began, she added."}, {"title": "Microsoft shuts Windows 7, 8 users' free upgrade to Windows 10, 11", "content": "Microsoft has now blocked Windows 7 and Windows 8 users from activating a copy of Windows 10 and Windows 11 for free. The activation status of users who have already upgraded their Windows operating system using any method won't change. Microsoft said the option for Windows 10 users to upgrade to Windows 11 is still available free of charge."}, {"title": "FTX Founder tried to get funds from Saudi Crown Prince: Ex-partner", "content": "FTX Founder Sam Bankman-Fried said he might try to raise funds from Saudi Crown Prince Mohammed bin Salman, his former girlfriend and Alameda Research's ex-CEO Caroline Ellison said. Bankman-Fried was looking to sell FTX equity to create liquidity at FTX. Ellison said Bankman-Fried also tried boosting FTX's market share by getting regulators to \"crack down\" on rival Binance."}, {"title": "HCLTech to hire 10,000 freshers in FY24", "content": "HCLTech said it will target hiring 10,000 freshers this year, compared to around 27,000 freshers hired in 2022-23. In the second quarter ended September 30, the company's attrition stood at 14.2%. \"We consciously didn't backfill attrition as a lot of freshers we hired in the last 18 months are now ready to be deployed,\" CEO and MD C Vijayakumar said."}, {"title": "Priyanka and Sophie unfollow each other on Instagram amid Sophie's divorce with Joe Jonas", "content": "Priyanka Chopra and Sophie Turner have unfollowed each other on Instagram amid Sophie's divorce with Joe Jonas. Although Sophie no longer follows Priyanka, she still follows Priyanka's husband, singer Nick Jonas. Joe and Sophie filed for divorce last month, after four years of marriage. Priyanka has not commented on the ongoing divorce of Joe and Sophie. "}, {"title": "Boney Kapoor shares pics of Sridevi when she was pregnant with Janhvi Kapoor", "content": "Producer Boney Kapoor shared pictures of his late wife, actress Sridevi from when she was pregnant with Janhvi Kapoor. \"Magic of Gautam Rajadhyaksha...these pictures were shot by him at his home while Sri was pregnant with Janhvi, created these images with just natural source of light,\" he wrote. Boney had earlier refuted rumours that Janhvi was born out of wedlock."}, {"title": "Director abused me as Amitabh Bachchan came late to set: Zeenat ", "content": "Veteran actress Zeenat Aman, in her Instagram post, recalled an incident when a director \"abused\" her after Amitabh Bachchan arrived late on the set. \"He was absolutely catatonic, and under the impression that it was I who had held up production,\" she added. Zeenat further said that Amitabh as well as the director later apologised to her. "}, {"title": "Was told I look like my mom, act like dad: Soha on 'Dil Maange...'", "content": "Soha Ali Khan recalled getting a bad review for her performance in her first Hindi film 'Dil Maange More'. \"I remember the first review that came out...was that 'she looks like her mother, but acts like her father',\" she added. \"My father was the one who was...most offended by it, because he was like, 'What does this mean?',\" said Soha.\n"}, {"title": "YouTuber IShowSpeed, known for humming 'Tunak Tunak Tun', meets Daler Mehndi", "content": "American YouTuber IShowSpeed, who is known for humming Daler Mehndi's song 'Tunak Tunak Tun' in many of his livestreams, met the singer in Delhi on Friday. \"The long awaited crossover,\" an X user reacted. \"The boy is living his dream,\" wrote another user. IShowSpeed will reportedly attend India-Pakistan ODI World Cup 2023 match in Ahmedabad on Saturday."}, {"title": "Will be audiences' day: Vicky on 'Sam Bahadur' clash with 'Animal'", "content": "Vicky Kaushal opened up about the box office clash between his upcoming film 'Sam Bahadur' and Ranbir Kapoor-starrer 'Animal' in December. \"It'll be the audiences' day more than our day,\" he said. \"In today's time, we, as an industry, should give...option of multiple films on the same day to the audience. That's how we'll flourish as an industry,\" added Vicky. "}, {"title": "Inshorts Co-founder Azhar Iqubal to appear as Shark on Shark Tank Season 3", "content": "Inshorts Co-founder Azhar Iqubal will appear as Shark on Shark Tank India Season 3, the makers announced on Friday. Earlier, Zomato CEO Deepinder Goyal and OYO Rooms Founder Ritesh Agarwal were announced as new Sharks. Sharks from previous seasons— Aman Gupta, Amit Jain, Anupam Mittal, Namita Thapar, Vineeta Singh and Peyush Bansal— will also feature in the new season."}, {"title": "My B and C grade films paid for my dream house, pillars alone cost ₹44 lakh: Kiran Kumar", "content": "Actor Kiran Kumar, speaking to Siddharth Kannan, said he stands by his decision to do B and C grade films, because they paid for his dream home. \"When you're working only for money...you retreat into your own zone,\" he stated, adding he hid his true emotions from his wife. \"Just the pillars in my...house...have cost ₹44 lakh,\" Kiran further said. "}, {"title": "Saved my back for action shoot: Hrithik as he takes Mumbai Metro ", "content": "Hrithik Roshan on Friday took a ride in the Mumbai Metro, the pictures of which he shared on his social media handles. In the pictures, he was seen interacting with the commuters. Hrithik wrote, \"The experience was spectacular. Beat the heat + the traffic. Saved my back for the action shoot I'm going for.\" "}, {"title": "Michael Douglas to get Satyajit Ray Lifetime Achievement Award ", "content": "Hollywood actor and producer Michael Douglas will be honoured with the Satyajit Ray Lifetime Achievement Award at the 54th International Film Festival of India in Goa, Minister of Information and Broadcasting Anurag Thakur announced on Friday. Douglas' \"deep love\" for India is well-known, Thakur said. Douglas has appeared in over 60 movies, including 'Wall Street' and 'Ant-Man' film series. "}]