[{"title": "Victoria's Secret ex-CEO cuts Harvard ties for not backing Israel", "content": "Victoria's Secret ex-CEO Leslie Wexner's foundation announced it's cutting its \"financial and programmatic\" ties with Harvard. \"We are stunned and sickened at the dismal failure of Harvard's leadership to take a clear...stand against the barbaric murders of innocent Israeli civilians,\" The Wexner Foundation said. Harvard's leaders were \"tiptoeing\" over Hamas' attacks against Israel, it added.", "category": "business"}, {"title": "HDFC Bank's Vigil Aunty ad gets criticism for stop-sign bindi, people call it 'anti-Hindu'", "content": "HDFC Bank's latest advertisement featuring Vigil Aunty is receiving criticism online. The advertisement, which aims to raise awareness regarding financial fraud, features Anuradha Menon as Vigil Aunty with a stop-sign like bindi. Some X users called the ad \"anti-Hindu\" and one of them also wrote, \"Is this how you represent Hindu culture with a stop sign on a woman's head?\"", "category": "business"}, {"title": "IMEC big opportunity for investors to partner with India: PM Modi", "content": "PM Narendra Modi at the Global Maritime India Summit said the India-Middle East-Europe Economic Corridor (IMEC) is a big opportunity for investors to partner with India. This corridor will change the face of regional and global trade, he stated. \"Construction of next-generation mega ports...island development...and expansion of multimodal hubs will be taken up under this project,\" he added.", "category": "business"}, {"title": "ICICI Bank fined ₹12 crore, Kotak ₹3.95 crore by RBI", "content": "The Reserve Bank of India (RBI) has imposed a penalty of ₹12.19 crore on ICICI Bank and a penalty of ₹3.95 crore on Kotak Mahindra Bank for non-compliance with certain regulatory norms. ICICI Bank was fined for contravention of directions issued by RBI on 'Loans and Advances-Statutory and Other Restrictions' and 'Financial Services provided by the Banks'.", "category": "business"}, {"title": "35 lakh weddings in 23 days to generate record ₹4.25 lakh crore business in India: CAIT", "content": "Traders' body Confederation of All India Traders (CAIT) has estimated that 35 lakh weddings will take place in India between November 23 and December 15. This is likely to generate the highest-ever business of around ₹4.25 lakh crore, CAIT said. In Delhi alone, over 3.5 lakh weddings are expected to generate a business of about ₹1 lakh crore, it added.", "category": "business"}, {"title": "Mahadev app key accused arrives from Dubai, held at Mumbai airport", "content": "Mrugank Mishra, a key accused in Mahadev betting app case, was arrested at the Mumbai airport on Saturday upon arriving from Dubai. A lookout notice had been issued against Mishra, who was hiding in Dubai. Originally from Madhya Pradesh, the 25-year-old allegedly helped the app's promoters open hundreds of dubious bank accounts to divert money generated by the scam.", "category": "business"}, {"title": "Bankman-Fried's trial delay request over Adderall shortage denied", "content": "A US court denied FTX Founder Sam Bankman-Fried's request to delay the trial against him until his prescribed medicine Adderall arrives. The ex-billionaire's lawyers said he hasn't \"been able to concentrate [without his medicine] at the level he ordinarily would\". Ordering trial to proceed as planned, Judge Lewis Kaplan said, \"I can't have lawyers giving drugs to people on trial.\"", "category": "business"}, {"title": "Indian wheat prices hit 8-month high", "content": "Prices of wheat in India have reached an eight-month high due to strong demand amid festivals, limited supplies and high import duty. Wheat prices in New Delhi jumped by 1.6% on Tuesday to ₹27,390 per metric tonne, highest since February 10. Notably, the Indian government last month said it had no immediate plans to abolish 40% import tax on wheat.", "category": "business"}, {"title": "Dabur gets ₹321 crore GST demand notice", "content": "Dabur India has received a notice to pay Goods and Services Tax (GST) of ₹320.6 crore. \"The GST short paid/not-paid has been advised to be paid by the company along with the amount of applicable interest and penalty,\" Dabur said. \"The company will challenge the same based on strong merits by way of filing its reply/submissions,\" it added.", "category": "business"}, {"title": "'Kill list' of LinkedIn staff being fired was leaked before announcement: Report", "content": "A list with names of about 500 employees was leaked internally before LinkedIn officially announced on Monday that it was laying off over 600 employees, Insider reported. An employee had warned about the \"kill list\" on an anonymous forum for verified employees. The list, which could be accessed by anyone, was deleted after employees started asking the management about it.", "category": "business"}, {"title": "Netherlands defeat South Africa in another upset at ODI World Cup 2023", "content": "Netherlands, the lowest-ranked team in the ongoing ODI World Cup 2023, caused another upset in the tournament by defeating South Africa by 38 runs at the Himachal Pradesh Cricket Association Stadium in Dharamshala on Tuesday. Earlier, Afghanistan had registered a 69-run win against England in Delhi. This is South Africa's first defeat in ODI World Cup 2023.", "category": "sports"}, {"title": "People would tell my parents 'Don't allow her to wear shorts': Asiad medallist Sutirtha", "content": "Table tennis player Sutirtha Mukherjee, who along with Ayhika Mukherjee bagged bronze in women's doubles TT event at 19th Asian Games, said where she grew up, people weren't that open-minded. \"People would [tell my parents] 'Don’t allow her to wear shorts',\" she added. She further said, \"Thankfully...my parents didn’t listen to any of that and gave me...freedom to play.\"", "category": "sports"}, {"title": "Are Netherlands doing them in again: Harsha on SA's collapse", "content": "Commentator Harsha Bhogle took to X to state that batting second is turning out to be hazardous, after South Africa lost four wickets within 12 overs during their chase in the ODI World Cup 2023 match against Netherlands. \"Are Netherlands doing South Africa in again?\" he added. \"When the mind is uncertain and worried, the feet grow heavy,\" he stated.", "category": "sports"}, {"title": "Rishabh Pant shares video of him running on treadmill, Warner says 'Made my day'", "content": "Wicketkeeper-batter Rishabh Pant, who is undergoing rehab following his car accident, shared a video of him running on treadmill. \"No shortcuts, just pure hustle,\" he wrote. Commenting on his post, David Warner wrote, \"Made my day.\" Pant had met with an accident on December 30, 2022. He recently commenced batting and keeping in the nets. ", "category": "sports"}, {"title": "Sri Lanka Cricket lifts ban on Gunathilaka after acquittal in sexual assault case", "content": "Sri Lanka Cricket (SLC) has lifted ban on Danushka Gunathilaka after the batter was found not guilty of sexually assaulting his Tinder date in Australia. Gunathilaka was arrested last year on sidelines of T20 World Cup after a woman accused him of sexual intercourse without consent.  Sri Lanka Cricket had then suspended him from all forms of cricket in November.", "category": "sports"}, {"title": "Exceptional bowling: Uthappa as SA lose 4 batters in 12 overs", "content": "Reacting to South Africa losing four batters within 12 overs during their ODI World Cup 2023 match against Netherlands, former India wicketkeeper-batter Robin Uthappa tweeted, \"Dream start for Netherlands!\" \"Exceptional bowling by the Netherlands bowlers to rattle the South African top order,\" he added. South Africa are chasing a target of 246 in 43 overs.", "category": "sports"}, {"title": "PCB files complaint over crowd conduct against Pakistan players in World Cup match vs India ", "content": "The PCB has filed a complaint regarding inappropriate conduct targeted at Pakistan squad during the India-Pakistan ODI World Cup 2023 match held at Narendra Modi Stadium in Ahmedabad on October 14. It also lodged another formal protest with ICC over delays in visas for Pakistani journalists and absence of visa policy for Pakistan fans for the ongoing tournament.", "category": "sports"}, {"title": "Game vs SA could be over before powerplay if Eng bowl 1st: Butcher", "content": "Former England batter Mark Butcher said England's upcoming World Cup match against South Africa could get over before powerplay if England bowl first. \"Once the opposition...[gets] them on back foot, it doesn't look as if there's any way England can stop it,\" he added. Discussing England's loss against Afghanistan, Butcher stated, \"Chris Woakes got slaughtered...England were miles off pace.\"", "category": "sports"}, {"title": "I have never seen Rauf pick wickets like Bumrah did vs Pak: Akram", "content": "Ex-Pakistan captain Wasim Akram said he has never seen pacer Haris Rauf swing the ball and pick wickets like Jasprit Bumrah did during India's ODI World Cup 2023 match against Pakistan. \"Haris only picks wickets when batters go after him...He has to improve his length while bowling in ODIs,\" he added. Bumrah dismissed Pakistan batters Shadab Khan and Muhammad Rizwan.", "category": "sports"}, {"title": "3 of Netherlands' cricketers playing against SA today represented SA earlier", "content": "Netherlands' Sybrand Engelbrecht, Colin Ackermann & Roelof van der Merwe, who are playing against South Africa in their ODI World Cup 2023 match today, had represented South Africa earlier.  Engelbrecht and Ackermann have played for South Africa Under-19 team, while Roelof played 26 matches for South Africa in international cricket. Netherlands scored 245/8 in 43 overs in the rain-curtailed match.", "category": "sports"}, {"title": "Palestinian, Arab, Muslim Googlers deeply affected by rise in Islamophobia: Pichai", "content": "Google CEO Sundar Pichai in an e-mail to employees informed that the company is giving $8 million in grants to nonprofits providing relief to civilians affected in Israel and Gaza. \"What our 2,000+ colleagues in Israel are going through is heartbreaking,\" Pichai wrote. \"Our Palestinian, Arab and Muslim Googlers are deeply affected by a concerning rise in Islamophobia,\" he added.", "category": "technology"}, {"title": "Russia fines Zoom $1.18mn for working without local office: Report", "content": "Russia has imposed a $1.18 million fine on Zoom for operating in the country without a local office, Reuters reported citing RIA news agency. The fine's amount is reportedly set at a 10th of Zoom's 2022 revenues in Russia. Zoom was fined around $153,800 last week over failure to save Russian citizens' data on a local server, the report said.", "category": "technology"}, {"title": "US restricts sale of more advanced AI chips to China", "content": "The US on Tuesday unveiled plans to restrict the sale of more advanced AI chips to China to close loopholes in the measures announced last October. NVIDIA's A800 and H800 chips, which were specifically designed for the China market, will be among the chips affected by the latest policy. The rules also blacklist Chinese chip designers Moore Threads and Biren.", "category": "technology"}, {"title": "Apple unveils new Pencil with USB-C port costing ₹7,900", "content": "Apple on Tuesday unveiled the new Apple Pencil with low latency, tilt sensitivity and a USB-C port that costs ₹7,900 in India. Designed with a matte finish and a flat side that magnetically attaches to the side of iPad for storage, the new Apple Pencil supports hover, allowing users to sketch and illustrate with even greater precision.", "category": "technology"}, {"title": "Apple's cheaper headset to have less sensors, no EyeSight: Report", "content": "Apple is reportedly planning to use fewer external cameras and sensors in a lower-cost version of its $3,500 Vision Pro headset. As per a report from Bloomberg, the cheaper version will also have no EyeSight, an external display that shows a user's eyes. The company has reportedly discussed prices ranging from $1,500 to $2,500 for the new version. ", "category": "technology"}, {"title": "Dubai Police unveils driverless, AI-powered patrol vehicle", "content": "Dubai Police has unveiled a \"self-driving\" patrol vehicle that will be used to boost security in residential areas. The vehicle features an electric battery that lasts 15 hours and a 360-degree camera capable of using AI to recognise faces and read car numbers. Authorities said it also contains a drone to access areas unreachable by the vehicle. ", "category": "technology"}, {"title": "Bankman-Fried's trial delay request over Adderall shortage denied", "content": "A US court denied FTX Founder Sam Bankman-Fried's request to delay the trial against him until his prescribed medicine Adderall arrives. The ex-billionaire's lawyers said he hasn't \"been able to concentrate [without his medicine] at the level he ordinarily would\". Ordering trial to proceed as planned, Judge Lewis Kaplan said, \"I can't have lawyers giving drugs to people on trial.\"", "category": "technology"}, {"title": "'Apple AirTag led to multiple murders,' claims lawsuit in US", "content": "Apple is facing a class action lawsuit in US that claims its tracking device AirTag \"has become the weapon of choice of stalkers\". \"Multiple murders have occurred in which the murderer used an AirTag to track the victim,\" the lawsuit alleges. The case was initially filed in December last year but now over 30 new plaintiffs have joined the lawsuit.", "category": "technology"}, {"title": "'Kill list' of LinkedIn staff being fired was leaked before announcement: Report", "content": "A list with names of about 500 employees was leaked internally before LinkedIn officially announced on Monday that it was laying off over 600 employees, Insider reported. An employee had warned about the \"kill list\" on an anonymous forum for verified employees. The list, which could be accessed by anyone, was deleted after employees started asking the management about it.", "category": "technology"}, {"title": "Facebook, YouTube, Google suppress pro-Palestine posts: Think tank", "content": "Think tank Hampton Institute alleged that social media platforms are suppressing pro-Palestine posts. \"YouTube is being paid lot of money to run nonstop ads from Israeli government,\" the institute said. \"Google has their search parameters set to prioritise...ahistorical information in Israel's favour...Facebook [is] actively blocking posts about 'factual' history of Israel/Palestine,\" it added.", "category": "technology"}, {"title": "Planned to make 'Jab...' with Bobby, 'Highway' with Sunny: Imtiaz ", "content": "Filmmaker Imtiaz Ali revealed that he was planning to make 'Jab We Met' with Bobby Deol and trying to make 'Highway' with Sunny Deol. The filmmaker revealed that Bobby kept delaying 'Jab We Met' because he was getting offers from big directors. While 'Jab We Met' featured Shahid Kapoor in lead role along with Kareena Kapoor, 'Highway' starred Randeep Hooda.  ", "category": "entertainment"}, {"title": "Ranbir asks photographers to be careful as they surround Waheeda Rehman, video surfaces", "content": "Veteran actress Waheeda Rehman was honoured with the Dadasaheb Phalke Award at the 69th National Awards ceremony on Tuesday. She was sitting in front of Alia Bhatt and Ranbir Kapoor, when media photographers started surrounding her and taking photos, nearly pushing her desk. In a video that has surfaced online, Ranbir can be seen requesting the media to be cautious.", "category": "entertainment"}, {"title": "Don't break your bank: Zeenat to youngsters on pressure to spend on clothes", "content": "Actress Zeenat Aman took to Instagram to share a picture of her in jewellery and dress loaned to her. \"I'm sharing this because I don't want young people to feel pressured to buy new outfits or spend beyond their means just because they see celebrities in designer clothes,\" she wrote. \"Don't break your bank...enjoy what you wear,\" she added.", "category": "entertainment"}, {"title": "'Kabhi Khushi...' had really bad reviews, I was depressed: Johar", "content": "Filmmaker Karan Johar said that he was \"very depressed\" when 'Kabhi Khushi Kabhie Gham' was released as it got \"really bad reviews\". \"Everyone was like 'old wine, new bottle same thing, turned over',\" he added. Karan recalled reaching a theatre where the film was playing and witnessing huge traffic due to a line for the film's advance bookings. \n", "category": "entertainment"}, {"title": "Emotional moment: Sandeepa on visiting Kashmir home after 30 yrs ", "content": "Actress Sandeepa Dhar, who was just two when her Kashmiri pandit family was forced to leave their house in Kashmir due to insurgency, opened up about returning to Kashmir after 30 years. Describing her return as an emotional moment, she said, \"It was...very heartwarming to come back to normalcy because for Kashmiri pandits, that word...didn't exist in Srinagar.\" ", "category": "entertainment"}, {"title": "Won't work with Sivakarthikeyan again, he betrayed me: D Imman ", "content": "Music composer D Imman said that he will never work with actor Sivakarthikeyan again in this lifetime. \"It is because of a huge betrayal he did to me,\" he added. Imman further said it took time to realise he had been betrayed, adding, \"I confronted him on my part, and I can't reveal what he told me.\" \n", "category": "entertainment"}, {"title": "What a shame, I'm going to erase today: Director Onir on SC verdict on same-sex marriage", "content": "Filmmaker and gay rights activist Onir, expressing his disappointment over Supreme Court's verdict wherein it refused to legalise same-sex marriages, wrote on X, \"What a shame.\" \"It almost feels like today did NOT HAPPEN. I'm going to erase today,\" he wrote in another post. \"We had high expectations from today's verdict. But it has been very disappointing,\" Onir said.\n\n\n", "category": "entertainment"}, {"title": "Kriti Sanon, Allu Arjun's selfie in 'Pushpa' pose at National Awards ceremony goes viral", "content": "Kriti Sanon received the Best Actress award at the 69th National Film Awards ceremony on Tuesday for her performance in 'Mimi'. Meanwhile, Allu Arjun won the Best Actor award for his performance in 'Pushpa: The Rise'. Both the actors sat next to each other at the award ceremony and were seen striking the 'Pushpa' pose while taking a selfie.\n\n", "category": "entertainment"}, {"title": "Taylor Swift's Eras tour security guard joins IDF to combat Hamas", "content": "A security guard who provided protection to singer and songwriter Taylor Swift during her 'Eras Tour' has returned to Israel to enlist in the Israel Defense Forces (IDF) reserves amid the ongoing Israel-Hamas war. \"I could not stand on the sidelines while families are being slaughtered and burned alive...Just for being Jewish or for being Israelis,\" the former guard said.", "category": "entertainment"}, {"title": "Pics show Alia, Ranbir, Kriti, Allu Arjun interacting with Prez Murmu after National Awards", "content": "The 69th National Film Awards ceremony was held in Delhi today and the awards were presented by President Droupadi Murmu. Photos that have surfaced on the internet show Alia Bhatt, Ranbir Kapoor, Waheeda Rehman, Kriti Sanon, Karan Johar, Pankaj Tripathi, Allu Arjun, R Madhavan, SS Rajamouli, and Pallavi Joshi, among others, interacting with the President after the awards ceremony. \n\n", "category": "entertainment"}]